# DesignMember

DesignMember

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**id** | **int** | Element Id | [optional]

## Example

```python
from ideastatica_rcs_api.models.design_member import DesignMember

# TODO update the JSON string below
json = "{}"
# create an instance of DesignMember from a JSON string
design_member_instance = DesignMember.from_json(json)
# print the JSON string representation of the object
print(DesignMember.to_json())

# convert the object into a dict
design_member_dict = design_member_instance.to_dict()
# create an instance of DesignMember from a dict
design_member_from_dict = DesignMember.from_dict(design_member_dict)
```
[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)